/*
  Узнаете:
Что такое переменные
Как выводить сообщения на экран
Познакомился с типами int и String
Чем компиляция в Java отличается от других языков
Как делать комментарии и зачем они нужны

Напиши программу, которая выводит на экран надпись: «Амиго очень умный».
Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с «Амиго».
3. Текст должен заканчиваться на «умный».
4. Текст должен состоять из 17 символов, включая пробелы.
5. Выводимый текст должен соответствовать заданию.
 */
package Uroven_0 ;

/**
 Drozdova Angelina
 */
public class Zadanie_1_1 {
  public static void main(String[] args) {
      System.out.println("Амиго очень умный");  
}}
